clear all; 
close all; 
clc 

%% 产生数据集
%x1=[119.28,26.08;%福州
%   121.31,25.03;%台北
%    121.47,31.23;%上海
%    118.06,24.27;%厦门
%    121.46,39.04;%大连
%    122.10,37.50;%威海
%    124.23,40.07];%丹东
 
%x2=[129.87,32.75;%长崎
%     130.33,31.36;%鹿儿岛
%     131.42,31.91;%宫崎
%     130.24,33.35;%福冈
%     133.33,15.43;%鸟取
%     138.38,34.98;%静冈
%     140.47,36.37];%水户 
 
% 增加内陆城市
 x1=[119.28,26.08;%福州
     121.31,25.03;%台北
     121.47,31.23;%上海
     118.06,24.27;%厦门
     113.53,29.58;%武汉
     104.06,30.67;%成都
     116.25,39.54;%北京
     121.46,39.04;%大连
     122.10,37.50;%威海
     124.23,40.07];%丹东
 x2=[129.87,32.75;%长崎
     130.33,31.36;%鹿儿岛
     131.42,31.91;%宫崎
     130.24,33.35;%福冈
     136.54,35.10;%名古屋
     132.27,34.24;%广岛
     139.46,35.42;%东京
     133.33,15.43;%鸟取
     138.38,34.98;%静冈
     140.47,36.37];%水户

x0=ones(1,size(x1,1)); %用于样本增广
X1=[x0;x1'];   
Y1=ones(1,size(x1,1));    
X2=[x0;x2'];     
Y2=-ones(1,size(x2,1));     

trainData=[X1,X2];      
trainLabel=[Y1,Y2];  

%% 分类器
z=zeros(1,2);
Q=[0 z;z.' eye(2)];
p=zeros(1,2+1);
A1=zeros(3,size(x1,1)*2);
for i=1:3
    A1(i,:)=trainData(i,:).*trainLabel;
end
A=-1*A1';         
c=(zeros(1,size(x1,1)*2)-1)';  
u=quadprog(Q,p,A,c);
figure(1);
plot(X1(2,:),X1(3,:),'ro',X2(2,:),X2(3,:),'bo','LineWidth', 2);
X=120:0.2:130;
Y=-1*(u(2,:)*X+u(1,:))/u(3,:); 
hold on;
plot(123.28,25.45,'kp','LineWidth', 2, 'markersize', 10);  %钓鱼岛坐标
plot(X,Y,'m-','LineWidth',1);
legend("中国城市","日本城市","钓鱼岛","分类线");
